#### WallSweepOrientation Enumeration

---

|  |
| --- |
| See Also |

Represents the orientation of horizonally placed sweep's profile relative to the wall side face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public enum WallSweepOrientation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WallSweepOrientation ``` |

| Visual C++ |
| --- |
| ``` public enum class WallSweepOrientation ``` |

# Members

| Member name | Description |
| --- | --- |
| Horizontal | Profile is oriented horizontally regardless of wall slant angle |
| Perpendicular | Profile is perpendicular to the wall side face |

# See Also

Autodesk.Revit.DB Namespace